-- Создание таблицы "Отделы" (Departments)
CREATE TABLE Departments (
    department_id SERIAL PRIMARY KEY,
    department_name VARCHAR(255) NOT NULL,
    manager_id INTEGER NOT NULL,
    budget NUMERIC,
    establishment_year INTEGER NOT NULL
);

-- Создание таблицы "Сотрудники" (Employees)
CREATE TABLE Employees (
    employee_id SERIAL PRIMARY KEY,
    first_name VARCHAR(255) NOT NULL,
    last_name VARCHAR(255) NOT NULL,
    position VARCHAR(255) NOT NULL,
    salary NUMERIC,
    hire_date DATE NOT NULL,
    department_id INTEGER,  -- Внешний ключ для связи с таблицей "Отделы"
    FOREIGN KEY (department_id) REFERENCES Departments(department_id)
);

-- Добавление моковых данных для таблицы "Отделы" (Departments)
INSERT INTO Departments (department_id, department_name, manager_id, budget, establishment_year)
VALUES
    (1, 'Отдел продаж', 101, 50000.00, 2010),
    (2, 'Отдел разработки', 102, 75000.00, 2005),
    (3, 'Отдел маркетинга', 103, 60000.00, 2012),
    (4, 'Отдел финансов', 104, 55000.00, 2008);

-- Добавление моковых данных для таблицы "Сотрудники" (Employees)
INSERT INTO Employees (employee_id, first_name, last_name, position, salary, hire_date, department_id)
VALUES
    (101, 'Иван', 'Иванов', 'Менеджер по продажам', 60000.00, '2015-03-10', 1),
    (102, 'Петр', 'Петров', 'Разработчик', 80000.00, '2014-06-20', 2),
    (103, 'Анна', 'Сидорова', 'Маркетолог', 65000.00, '2016-01-15', 3),
    (104, 'Олег', 'Федоров', 'Финансовый аналитик', 55000.00, '2017-09-05', 4),
    (105, 'Мария', 'Павлова', 'Менеджер по продажам', 62000.00, '2018-11-30', 1),
	(106, 'Елена', 'Иванова', 'Менеджер по продажам', 58000.00, '2019-04-12', 1),
    (107, 'Андрей', 'Смирнов', 'Разработчик', 82000.00, '2013-08-14', 2),
    (108, 'Наталья', 'Козлова', 'Маркетолог', 67000.00, '2020-02-28', 3),
    (109, 'Денис', 'Королев', 'Финансовый аналитик', 56000.00, '2016-07-10', 4),
    (110, 'Ирина', 'Морозова', 'Менеджер по продажам', 61000.00, '2021-05-17', 1),
	(111, 'Сергей', 'Попов', 'Менеджер по продажам', 59000.00, '2022-03-25', 1),
    (112, 'Ольга', 'Соколова', 'Разработчик', 78000.00, '2019-07-10', 2),
    (113, 'Владимир', 'Карпов', 'Маркетолог', 64000.00, '2020-08-15', 3),
    (114, 'Евгений', 'Андреев', 'Финансовый аналитик', 57000.00, '2018-12-05', 4),
    (115, 'Лариса', 'Григорьева', 'Менеджер по продажам', 63000.00, '2021-09-03', 1),
    (116, 'Игорь', 'Борисов', 'Разработчик', 75000.00, '2020-05-22', 2),
    (117, 'Александра', 'Егорова', 'Маркетолог', 66000.00, '2017-11-08', 3),
    (118, 'Дмитрий', 'Кузнецов', 'Финансовый аналитик', 58000.00, '2021-02-18', 4),
    (119, 'Татьяна', 'Петрова', 'Менеджер по продажам', 61000.00, '2019-06-12', 1),
    (120, 'Антон', 'Сидоров', 'Разработчик', 77000.00, '2020-10-30', 2),
    (121, 'София', 'Иванова', 'Маркетолог', 67000.00, '2018-04-17', 3),
    (122, 'Максим', 'Павлов', 'Финансовый аналитик', 59000.00, '2017-03-11', 4),
    (123, 'Елена', 'Морозова', 'Менеджер по продажам', 62000.00, '2022-01-08', 1),
    (124, 'Андрей', 'Смирнов', 'Разработчик', 76000.00, '2019-09-28', 2),
    (125, 'Наталья', 'Козлова', 'Маркетолог', 68000.00, '2021-06-07', 3),
    (126, 'Денис', 'Королев', 'Финансовый аналитик', 60000.00, '2020-04-03', 4),
    (127, 'Мария', 'Комарова', 'Менеджер по продажам', 64000.00, '2022-05-14', 1),
    (128, 'Анна', 'Зайцева', 'Разработчик', 77000.00, '2021-03-19', 2),
    (129, 'Иван', 'Федоров', 'Маркетолог', 69000.00, '2019-08-02', 3),
    (130, 'Олег', 'Исаев', 'Финансовый аналитик', 61000.00, '2020-11-11', 4);